<a href="https://colab.research.google.com/github/aligtr/ml/blob/master/Pr03_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

Pandas - это библиотека для работы с табличными данными.

Как всегда, [официальный сайт](https://pandas.pydata.org/) предоставляет самую актуальную и полезную информацию. Доки по функциям и классам [здесь](https://pandas.pydata.org/pandas-docs/stable/reference/index.html).

Установка pandas как обычно не составляет сложностей:

In [1]:
!pip install pandas==1.0.0

Requirement already satisfied: pandas==1.0.0 in /usr/local/lib/python3.6/dist-packages (1.0.0)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2018.9)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (1.18.5)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas==1.0.0) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas==1.0.0) (1.15.0)

Импорт библиотеки с устоявшимся сокращением:

In [2]:
import pandas as pd

# Создание объекта таблицы

Начнем с простого создания объекта основного класса в pandas - `DataFrame`. Фреймы в pandas представляют собой двумерные массивы (матрицы) данных. Для применения в машинном обучении визуально можно представить данные следующим образом:

$$
X = 
\begin{bmatrix}
x^{(1)}_1 & \dots & x^{(1)}_{m-1} & x^{(1)}_m \\
x^{(2)}_1 & \dots & x^{(2)}_{m-1} & x^{(2)}_m \\
\vdots & \ddots &  \vdots & \vdots  \\
x^{(n)}_1 & \dots & x^{(n)}_{m-1} & x^{(n)}_m \\
\end{bmatrix}
$$

где $n$ - количество записей (сэмплов/рядов) в данных, $m$ - количество признаков (предикторов/фич) в данных.

> **Признаки** в данных - это те данные, на основе которых производится анализ данных, обучение модели и предсказание. В реальной задаче признаками могут быть "цена", "пол", "группа крови", "текст в заявке" и т.д. [Колонки в таблице]

> **Записи** в данных - сущности, каждая из которых имеет свой набор значений признаков. В базе данных банка это могут быть отдельные транзакции. Все транзакции имеют одинаковые признаки, но значения этих признаков у каждой записи свои. [Строки в таблице]

Создание `DataFrame` возможно разными способами, для начала попробуем создать фрейм из двумерного массива:

In [3]:
import numpy as np

arr = np.random.randint(0, 10, size=(5, 3))
print(arr)

[[1 8 0]
 [4 6 2]
 [6 3 6]
 [6 3 6]
 [3 8 3]]

In [4]:
# Создание фрейма - просто вызвать конструктор
df = pd.DataFrame(data=arr,columns=('g1','g2','g3'))
# Фреймы удобнее отображать с помощью встроенных средств Jupyter
df

   g1  g2  g3
0   1   8   0
1   4   6   2
2   6   3   6
3   6   3   6
4   3   8   3

В представленном фрейме важно отметить две особенности:
- Колонки (признаки) имеют имена, но так как мы их (имена) не задали, то они создались автоматически;
- Каждая строка (запись) имеет **уникальный** индекс, тоже создались сами, так как мы не передавали своих индексов.

Для задания имен колонок используется аргумент в конструкторе `columns`, в который передаеся список имен по количеству признаков. Для задания индексов аргумент `index`, в который передается список индексов по количеству записей в массиве.

## Задание

Создайте фрейм с именами колонок `'col_1', 'col_2', 'col_3'` и индексами по алфавиту (`'A', 'B', 'C', ...` или `'A', 'Б', 'В', ...`).

In [5]:
# TODO
arr = np.random.randint(0, 10, size=(5, 3))
df = pd.DataFrame(data=arr,columns=('col_1', 'col_2', 'col_3'),index=('A', 'B', 'C','D','E'))
df

   col_1  col_2  col_3
A      2      7      1
B      4      1      7
C      8      9      4
D      3      2      9
E      6      1      7

# Создание фрейма из словарей

Другим способом создания фрейма является конструктор на основе словаря с данными:

In [6]:
# Создается словарь, в котором ключи будут названиями колонок,
#   а значения - данные по этим колонкам
data = {
    'test_1_mark': [4.6, 3.8, 5.0, 4.5],
    'test_2_mark': [5.0, 3.9, 4.7, 4.5]
}

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          4.7
3          4.5          4.5

Альтернативой использования словарей является создание массива словарей:

In [7]:
# Создается список записей, каждая запись представлена словарем
# В словаре ключи - названия колонок
# При создании фрейма pandas просмотри все возможные ключи словарей в списке
#   и создаст колонок по их названиям
data = [
    {
        'test_1_mark': 4.6,
        'test_2_mark': 5.0
    },
    {
        'test_1_mark': 3.8,
        'test_2_mark': 3.9
    },
    {
        'test_1_mark': 5.0
    },
]

pd.DataFrame(data)

   test_1_mark  test_2_mark
0          4.6          5.0
1          3.8          3.9
2          5.0          NaN

Обратите внимание, в одной записи отсутсвовало значение для колонки и во фрейме такое значение обозначено как `NaN`.

> **NaN** (Not a Number) - представление пропусков во фрейме.

Пропуски в данных являение достаточно распространенное. Например, если данные собираются путем анкетирования, то опциональный вопрос может не иметь ответа, поэтому такие записи пропускаются. При разработке моделей машинного обучения с пропусками ведется отдельная работа, но для сырых данных - это нормальное явление.

# Типы данных

Как и в numpy, pandas поддерживает различные типы данных. Для примера создадим фрейм, в котором колонки имеют разные типы данных:

In [8]:
df = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': np.array([2.] * 4, dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})
df

     A          B    C  D      E    F
0  1.0 2013-01-02  2.0  3   test  foo
1  1.0 2013-01-02  2.0  3  train  foo
2  1.0 2013-01-02  2.0  3   test  foo
3  1.0 2013-01-02  2.0  3  train  foo

Как видите, создается фрейм, в котором каждая колонка имеет свой тип. Из них для нас имеются два новых типа:
- `Timestamp` - конструктор для временного типа в pandas (`datetime64`);
- `Categorical` - категориальный тип, который в большинстве своем является альтернативой численным данным.

> **Категориальные данные** - данные, значения которых ограничены списком категорий (одно из возможных значений);
> **Численные данные** - данные, которые имеют численное значение (вещественное или целочисленное).

Для просмотра информации о фрейме полезно использовать метод `DataFrame.info()`:

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 356.0+ bytes

Если тип данных не задан явно как категориальный, то строки будут иметь тип `object`, как универсальный тип данных.

# Обзор данных

Начало любого анализа данных происходит с того, что мы должны разобраться, с чем имеем дело, поэтому возможности быстрого обзора данных - то, что нужно:

In [11]:
df = pd.DataFrame(
    data=np.random.randint(-10, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
 
# Функция получения первых записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.head(10)

   x1  x2  x3
0   3   1  -8
1  -6   3   0
2 -10   4   1
3  -7  -7   6
4   2   8  -7
5  -8  -3  -5
6   3  -9  -7
7   2  -3  -2
8  -2   5 -10
9   6   7   3

In [13]:
# Функция получения последних записей фрейма
# Аргументом задается количество выводимых данных
#   Если не задано - 5 по-умолчанию
df.tail(4)

    x1  x2  x3
11   3  -6  -9
12   5  -6  -4
13  -2   6   7
14  -6   9 -10

In [14]:
# Функция отображения основной информации о фрейме:
#   Количество записей
#   Типы колонок
#   Количество ненулевых значений
#   Тип индекса
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x1      15 non-null     int64
 1   x2      15 non-null     int64
 2   x3      15 non-null     int64
dtypes: int64(3)
memory usage: 488.0 bytes

In [15]:
# Функция отображения статистики по численным колонкам
df.describe()

              x1         x2         x3
count  15.000000  15.000000  15.000000
mean   -1.600000   0.466667  -3.400000
std     5.342552   5.986493   5.641682
min   -10.000000  -9.000000 -10.000000
25%    -6.500000  -4.500000  -7.500000
50%    -2.000000   1.000000  -5.000000
75%     3.000000   5.500000   0.500000
max     6.000000   9.000000   7.000000

In [16]:
# Атрибут получения индексов фрейма
df.index

RangeIndex(start=0, stop=15, step=1)

In [17]:
# Или чтобы представить в виде списка
list(df.index)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [18]:
# Атрибут получения имен колонок фрейма
df.columns

Index(['x1', 'x2', 'x3'], dtype='object')

In [19]:
# Атрибут размерности фрейма
df.shape

(15, 3)

In [ ]:
# Преобразование к двумерному массиву numpy
df.to_numpy()

array([[ -6,  -4,  -4],
       [  1,   3,   4],
       [ -6,  -2,   5],
       [  5,  -1,  -4],
       [ -7,   4,   7],
       [ -6,  -6, -10],
       [-10,  -9,  -4],
       [ -6,   6,   6],
       [ -2, -10,   1],
       [  9,   6,  -4],
       [  5,   0,   6],
       [  5,   1,  -8],
       [ -5,  -4,   6],
       [ -5,   8, -10],
       [ -2,  -2,  -4]])

In [20]:
# Получение транспонированного представления
# Колонки -> ряды, ряды -> колонки
df.T
 
# (*) Транспонирование вряд ли часто понадобится при анализе, но учитывать стоит

    0  1   2  3  4  5  6  7   8  9  10  11  12  13  14
x1  3 -6 -10 -7  2 -8  3  2  -2  6  -7   3   5  -2  -6
x2  1  3   4 -7  8 -3 -9 -3   5  7  -2  -6  -6   6   9
x3 -8  0   1  6 -7 -5 -7 -2 -10  3  -6  -9  -4   7 -10

# Обращение к данным

Так как данные представлены в виде двумерного массива, то обращение к ним является важным инструментом.

Начнем с того, чтобы обращаться к конкретной колонке:

In [22]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)
 
df

   x1  x2  x3
0   8   5   8
1   7   3   8
2   5   3   2
3   8   9   3
4   1   0   8

In [23]:
print(df['x1'])
print(type(df['x1']))

0    8
1    7
2    5
3    8
4    1
Name: x1, dtype: int64
<class 'pandas.core.series.Series'>

Индексация во фрейме по колонкам производится по имени колонок. В результате создается объект `Series` (ряд), который является одномерным массивом. В случае индексации по колонкам каждая запись в ряду имеет индекс из основного фрейма.

Аналогичный тип данных создается, когда мы обращаемся к конкретной записи в данных. Кстати, просто так не обратиться, поэтому для индексации по записям используются методы `DataFrame.iloc[]` и `DataFrame.loc[]`.

Взгляните на разницу:

In [25]:
data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

   feature1  feature2 feature3
A         0  0.000000   string
B         1  0.714286   string
C         2  1.428571   string
D         3  2.142857   string
E         4  2.857143   string

In [26]:
df.iloc[2]

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [27]:
df.loc['C']

feature1          2
feature2    1.42857
feature3     string
Name: C, dtype: object

In [28]:
df.iloc[2, 1]

1.4285714285714286

In [32]:
df.loc['C', 'feature2']

1.4285714285714286

Если разница не явна, то обсудим:
> `.iloc[]` используется для обращения по индексам как рядов, так и колонок;

> `.loc[]` используется для обращения по именованиям как рядов, так и колонок.

В индексации можно применять как слайсы, подобно тем, что научились применять в numpy, так и массивы в качестве индексов.

При индексации по единственной строке создается объект `Series`, но уже с индексами в виде колонок.

## Задание

Выведите часть фрейма со второго ряда по девятый (индексы с 'C' по 'I') и только `feature1` и `feature3`:

In [ ]:
data = {
    'feature1': np.arange(15),
    'feature2': np.linspace(0, 10, 15),
    'feature3': 'string',
}
df = pd.DataFrame(data, index=list('ABCDEFGHIJKLMNO'))
df.head()

In [33]:
# TODO - выделите часть фрейма с помощью .loc[]
print(df.loc['C':'I',('feature1', 'feature3')])

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

In [44]:
# TODO - выделите часть фрейма с помоью .iloc[]
print(df.iloc[2:9,[0,2]])

   feature1 feature3
C         2   string
D         3   string
E         4   string
F         5   string
G         6   string
H         7   string
I         8   string

# Условная индексация

При работе с данными часто необходимо выбрать часть данных по условному признаку. По аналогии с работой в numpy, применение булевых операторов на ряд данных создает такой же по размеру ряд из булевых элементов, представляющих собой маску:

In [45]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   3   1   2
1   4   8   0
2   2   0   0

In [46]:
df['x1'] > 5

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13     True
14    False
Name: x1, dtype: bool

После того, как маска получена, можно применить ее, чтобы выбрать конкретные записи (строки) данных. При этом, индексация маской работает как при использовании `[]`, так и при использовании `.loc[]`.

In [47]:
mask = df['x1'] > 5
df[mask]

# Или df[df['x1'] > 5]

    x1  x2  x3
5    7   5   7
10   9   0   7
13   8   3   8

Чтобы получить значения, обратные условию, можно воспользоваться оператором НЕ: `~` - он инвертирует маску условия:

In [48]:
df[~(df['x1'] > 5)]

    x1  x2  x3
0    3   1   2
1    4   8   0
2    2   0   0
3    2   3   9
4    1   2   6
6    5   4   1
7    5   3   7
8    2   6   7
9    0   4   7
11   3   3   1
12   2   8   3
14   3   6   8

> Как и в numpy, для применения нескольких операций необходимо оборачивать каждую в скобки.

## Задание

Выберите записи во фрейме, которые по признаку `x1` имеют значение больше 3, а по признаку `x3` - меньше 8.

In [ ]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

In [50]:
# TODO - отфильтровать фрейм по значениям признаков
mask=(df['x1']>3)&(df['x3']<8)
df[mask]

    x1  x2  x3
1    4   8   0
5    7   5   7
6    5   4   1
7    5   3   7
10   9   0   7

In [59]:
# TODO - отобразите только колонки x1 и x2 с учетом условий 
#           (используйте .loc[])
df[mask].loc[:,('x1', 'x2')]

    x1  x2
1    4   8
5    7   5
6    5   4
7    5   3
10   9   0

## Задание

С помощью метода `DataFrame.query()` получите записи, которые соответсвуют условию сравнения колонок $x1 > x3$:

In [ ]:
df = pd.DataFrame(
    [[1, 2, 6], [5, 1, 1], [8, 4, 6], [4, 1, 1], [9, 9, 0], [-1, 2, 1], [5, 5, 5]],
    columns = ['x1', 'x2', 'x3']
)
df

In [61]:
# TODO - Методом DataFrame.query() получить записи, удовлетворяющие условию
#           x1 > x3
df.query('x1 > x3')

    x1  x2  x3
0    3   1   2
1    4   8   0
2    2   0   0
6    5   4   1
10   9   0   7
11   3   3   1

In [62]:
# TODO - Сделать аналогичное действие, но уже с помощью условной индексации
df[df['x1']>df['x3']]

    x1  x2  x3
0    3   1   2
1    4   8   0
2    2   0   0
6    5   4   1
10   9   0   7
11   3   3   1

# Операции с рядами / Новые колонки

Работа с фреймами и рядами данных в pandas поддерживает многие операции по аналогии с работой в numpy.

In [63]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   3   8   7
1   2   8   4
2   3   9   2

In [64]:
# Создать новую колонку можно по аналогии с новым ключем в словаре
# Сложение нескольких Series и запись в новую колонку
df['x1+x2'] = df['x1'] + df['x2']
df.head(3)

   x1  x2  x3  x1+x2
0   3   8   7     11
1   2   8   4     10
2   3   9   2     12

In [65]:
# Поэлементное умножение
df['x1*x3'] = df['x1'] * df['x3']
df.head(3)

   x1  x2  x3  x1+x2  x1*x3
0   3   8   7     11     21
1   2   8   4     10      8
2   3   9   2     12      6

In [66]:
# Взятие среднего по колонке (метод Series.mean())
df['x1'].mean()

3.933333333333333

In [67]:
# Использование функций numpy для работы с колонками
df['x2_exp'] = np.exp(df['x2'])
df.head(3)

   x1  x2  x3  x1+x2  x1*x3       x2_exp
0   3   8   7     11     21  2980.957987
1   2   8   4     10      8  2980.957987
2   3   9   2     12      6  8103.083928

Как вы заметили, ряды (это же одномерные массивы) можно обрабатывать:
- операциями Python;
- методами класса Series;
- функциями numpy.

> Для создания новой колонки достаточно просто задать имя новой колонки и записать ряд данных (может быть даже одномерным массивом numpy), который имеет такой же размер, куда пишется.

Для случая, если нужной функции нет, то можно создать свою с помощью метода `Series.apply()`, которой передается название функции для применения над всем рядом.

In [68]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(3, 3)), 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
0   9   0   5
1   6   1   3
2   1   6   2

In [69]:
# Обязательно требование к функции - один аргумент
# Эта функция будет передана в apply() и pandas
#   будет вызывать ее и передавать в нее 
#   по одному элементу из ряда
# Возвращать функция должна результат операции над элементом
def my_func(x):
    print(type(x))
    print(x)
    return x*2

df['result'] = df['x1'].apply(my_func)
df

<class 'int'>
9
<class 'int'>
6
<class 'int'>
1

   x1  x2  x3  result
0   9   0   5      18
1   6   1   3      12
2   1   6   2       2

Как видно, в функцию передается каждый элемент в ряду, тип элемента соответсвует типу колонки. Результат метода `.apply()` - новый ряд с примененной функцией.

# Операции с фреймами

## Переименование колонок / индексов

Одной из полезных функций является возможность переименования имен колонок. Для этого имеется метод `DataFrame.rename()`:

In [79]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   3   7   4
1   2   2   0
2   2   5   7

In [81]:
# Методу передается в аргумент columns словарь, 
#   в котором ключи - имена колонок,
#   значения - новые имена для переименования
df.rename(
    columns={
        'x1': 'new_name_for_x1',
        'x3': 'that_not_x3' 
    },
    inplace=True
)
df.head(3)

   new_name_for_x1  x2  that_not_x3
0                3   7            4
1                2   2            0
2                2   5            7

> Аргумент `inplace` является достаточно распространенным в методах фреймов. Этот аргумент управляет тем, как произвести операцию: прямо в этом классе (при установленном True) или вернуть результатом новый фрейм с произведенной операцией (при установленном False).

Для сравнения аналогичный код без `inplace` выглядел бы так:
```python
df_renamed = df.rename(columns={
    'x1': 'new_name_for_x1',
    'x3': 'that_not_x3'
})
```

Для переименования индексов (названий записей) используется тот же принцип, но словарь передается в аргумент `index` с ключами - исходными названиями индексов, значениями - новыми значениями.

### Задание

Переименуйте индексы и колонки во фрейме

In [86]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    index=['A', 'B', 'C', 'D', 'E'], 
    columns=['x1', 'x2', 'x3']
)
df

   x1  x2  x3
A   7   3   5
B   8   7   2
C   0   0   3
D   0   2   7
E   8   6   8

In [87]:
# TODO - переименуйте индексы [A, C] -> [indA, indC] 
#           и колонки [x1, x3] -> [new1, new3]
df.rename(index={'A':'indA','C':'indC'},columns={'x1':'new1','x3':'new3'},inplace=True)
df

      new1  x2  new3
indA     7   3     5
B        8   7     2
indC     0   0     3
D        0   2     7
E        8   6     8

## Удаление колонок / строк

Данную операцию можно произвести двумя способами:
1. Выбрать колонки, которые необходимо оставить, простой индексацией;
2. Метод `DataFrame.drop()`.

In [88]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.head(3)

   x1  x2  x3
0   4   2   6
1   5   3   8
2   3   1   4

In [89]:
df.drop(columns=['x2'], inplace=True)
df.head(3)

   x1  x3
0   4   6
1   5   8
2   3   4

## Определение количества NaN

В данных часто бывают пропуски (NaN), при этом на первых этапах анализа важно понять их количество по каждому признаку. Для этого можно воспользоваться методом `DataFrame.isna()`, который создаст двумерный булевый фрейм, отвечающий на вопрос "является ли значение NaN?". После этого над всем фреймом можно применить метод `DataFrame.sum()`, который вернет ряд (Series) с количеством элементов True в булевом фрейме (элементов NaN в основном фрейме).

In [98]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(5, 3)), 
    columns=['x1', 'x2', 'x3']
)
df.iloc[0, :2] = np.nan
df.iloc[2, 1:] = np.nan

df

    x1   x2   x3
0  NaN  NaN  7.0
1  0.0  2.0  4.0
2  4.0  NaN  NaN
3  7.0  6.0  5.0
4  8.0  0.0  4.0

In [91]:
df.isna()

      x1     x2     x3
0   True   True  False
1  False  False  False
2  False   True   True
3  False  False  False
4  False  False  False

In [93]:
df.isna().sum(axis=1)

0    2
1    0
2    2
3    0
4    0
dtype: int64

## Заполнение пустых значений

Техники заполнения пустых значений имеют разнообразное представление, но одним из простых методов является заполнение константой. Для этого ряд данных имеет метод `Series.fillna()`, в который можно передать значение и вместо NaN элементов будет поставлена константа, указанная в аргументах.

In [99]:
df

    x1   x2   x3
0  NaN  NaN  7.0
1  0.0  2.0  4.0
2  4.0  NaN  NaN
3  7.0  6.0  5.0
4  8.0  0.0  4.0

In [104]:
df['x2'].fillna(np.mean(df['x2']), inplace=True)
df

    x1        x2   x3
0  NaN  2.666667  7.0
1  0.0  2.000000  4.0
2  4.0  2.666667  NaN
3  7.0  6.000000  5.0
4  8.0  0.000000  4.0

## Информация об уникальных значениях

При работе с категориальными данными полезна информация об уникальных значения признака, поэтому важно понимать, как проверить их количество:

In [105]:
df = pd.DataFrame({
    'col1': ['high', 'high', 'low', 'med', 'low', 'low', 'med', 'low', 'low', 'high'],
    'col2': [0, 1, 1, 2, 3, 1, 1, 2, 2, 2]
})
df

   col1  col2
0  high     0
1  high     1
2   low     1
3   med     2
4   low     3
5   low     1
6   med     1
7   low     2
8   low     2
9  high     2

In [106]:
# Метод DataFrame.nunique() позволяет вывести 
#   количество уникальных значений в каждой колонке
# Результат - Series с индексами - названиями колонок
df.nunique()

col1    3
col2    4
dtype: int64

In [107]:
# Метод Series.value_counts() показывает уникальные значения в ряду
#   и указывает их количество
df['col1'].value_counts()

low     5
high    3
med     2
Name: col1, dtype: int64

In [108]:
# Результат - Series с индексами - уникальными значениями
df['col2'].value_counts()

2    4
1    4
3    1
0    1
Name: col2, dtype: int64

## Фильтрация

Метод `DataFrame.filter()` позволяет отфильтровать и выбрать только те колонки/записи, котрые соответсвуют условию, заданному в аргументах:

In [109]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['col_one', 'col_two', 'col_three'])
df

        col_one  col_two  col_three
mouse         1        2          3
rabbit        4        5          6

In [110]:
# Отфильтровать по именам колонок
# Аналогично df[['col_one', 'col_three']]
df.filter(items=['col_one', 'col_three'], axis='columns')

        col_one  col_three
mouse         1          3
rabbit        4          6

In [119]:
# Отфильтровать по регулярному выражению
# Оставить только те колонки, которые оканчиваются на букву "o"
df.filter(regex='o$', axis='columns')

Empty DataFrame
Columns: []
Index: [dog in house, cat in house, pig in farm]

### Задание

Отфильруйте записи по строке, содержащейся в имени индекса (аргумент `like`):

In [120]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6], [7, 8, 9])),
                  index=['dog in house', 'cat in house', 'pig in farm'],
                  columns=['x1', 'x2', 'x3'])
df

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6
pig in farm    7   8   9

In [121]:
# TODO - отфильтруйте по записям, должны остаться записи, 
#           индекс которых содержит слово "house"
df.filter(like='house',axis=0,)

              x1  x2  x3
dog in house   1   2   3
cat in house   4   5   6

## Сортировка

Всегда полезно знать, как отсортировать данные, для этого мы воспользуемся методом `DataFrame.sort_values()`:

In [122]:
df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
}, index=['A', 'B', 'C', 'D', 'E', 'F'])
df

  col1  col2  col3 col4
A    A     2     0    a
B    A     1     1    B
C    B     9     9    c
D  NaN     8     4    D
E    D     7     2    e
F    C     4     3    F

In [123]:
# Отсортируем записи колонки col2
# Именно поэтому в axis ставится rows, так как
#   операция производится в колонке по каждому ряду
df.sort_values(by='col2', axis='rows')

  col1  col2  col3 col4
B    A     1     1    B
A    A     2     0    a
F    C     4     3    F
E    D     7     2    e
D  NaN     8     4    D
C    B     9     9    c

### Задание

Отсортируйте данные:

In [124]:
df = pd.DataFrame(
    np.random.randint(0, 20, size=(5, 5)), 
    columns=['col1', 'col2', 'col3', 'col4', 'col5']
)
df

   col1  col2  col3  col4  col5
0     6     4    11     4     3
1     9    11     0     6    12
2    16    18     9    17     0
3    15     3    12    12    18
4    13     3     1     6     1

In [128]:
# TODO - отсортируйте данные индекса 3 по убыванию
df.sort_values(by=3, axis=1,ascending=False)

   col5  col1  col3  col4  col2
0     3     6    11     4     4
1    12     9     0     6    11
2     0    16     9    17    18
3    18    15    12    12     3
4     1    13     1     6     3

## Разделение данных на категории

В ходе работы с данными часто бывает необходимо диапазон числовой переменной разбить на несколько групп (категорий). Например, заменить числовой диапазон температур воды $[-10; 60]$ на три категории $[низкая, средняя, высокая]$. Для таких целей используется функция `pd.cut()`:

In [129]:
df = pd.DataFrame({
    'temp': [59, 22, -10, 38, 20, 40, 38, 47, 20, 15, 13, 44, 57, 32, 38]
})
df.head()

   temp
0    59
1    22
2   -10
3    38
4    20

In [130]:
# Можно задать свои границы диапазона и названия категорий
# Если планируется три категории, то границ должно быть на одну больше - 
#   так задаются диапазоны для категорий
df['temp_cat'] = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    labels=['low', 'medium', 'high'],
    # Флаг, чтобы самое левое значение границы входило в первый диапазон
    include_lowest=True
)
df.head()

   temp temp_cat
0    59     high
1    22   medium
2   -10      low
3    38     high
4    20   medium

In [131]:
# Результат разделения имеет категориальный тип
df['temp_cat'].dtype

CategoricalDtype(categories=['low', 'medium', 'high'], ordered=True)

In [132]:
# Можно не задавать имена категориям, тогда он сам их назовет
result_after_cut = pd.cut(
    x=df['temp'],
    bins=[-10, 10, 25, 60],
    include_lowest=True
)
# Взглянем на имена
result_after_cut.unique()

[(25.0, 60.0], (10.0, 25.0], (-10.001, 10.0]]
Categories (3, interval[float64]): [(-10.001, 10.0] < (10.0, 25.0] < (25.0, 60.0]]

In [133]:
# Можно не задавать границы, лишь количество категорий - 
#   разделение будет на категории с одинаковой шириной диапазонов
result_after_cut = pd.cut(
    x=df['temp'],
    bins=3
)
result_after_cut.unique()

[(36.0, 59.0], (13.0, 36.0], (-10.069, 13.0]]
Categories (3, interval[float64]): [(-10.069, 13.0] < (13.0, 36.0] < (36.0, 59.0]]

### Задание

Разделите показатель качества в диапазоне $[0, 100]$ на три группы: плохое $[0-20]$, среднее $(20-45]$, хорошее $(45-85]$, отличное $(85-100]$. Выясните, что происходит со значениями, которые не попадают в диапазоны категорий:

In [149]:
df = pd.DataFrame({
    'quality': [ 7, 67, 21, 38,  2, -2, 79, 22,  5, 31, 77, 72, 23, 64, 99]
})
df.head()

   quality
0        7
1       67
2       21
3       38
4        2

In [150]:
# TODO - разделите данные на категории
# TODO - определите, какие записи не имеют категорий и почему
df['cut'] = pd.cut(
    x=df['quality'],
    bins=[0, 20, 45, 85, 100],
    labels=['0-20', '20-45', '45-85','85-100'],
    # Флаг, чтобы самое левое значение границы входило в первый диапазон
    include_lowest=True
)
df.head()

   quality    cut
0        7   0-20
1       67  45-85
2       21  20-45
3       38  20-45
4        2   0-20

## Агрегация данных

Агрегация данных - объединение группы данных для получения информации. Примерами операций аргегации являются: сумма, среднее, максимум, минимум.

В pandas агрегация может быть выполнена путем метода `DataFrame.aggregate()`:

In [151]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9],
                   [np.nan, np.nan, np.nan]],
                  columns=['A', 'B', 'C'])
df

     A    B    C
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0
3  NaN  NaN  NaN

In [154]:
# Получим значения минимумов и средних по всем колонкам
# Принцип аналогичен операциям в numpy - 
#   для агрегации по колонка операция должна пройти по рядам,
#   соответсвенно, axis='rows'
df.aggregate(['min', 'mean'], axis='rows')

        A    B    C
min   1.0  2.0  3.0
mean  4.0  5.0  6.0

In [155]:
# Зададим правила агрегации для каждой колонки
# Операции можно задавать строками или функциями numpy
df.aggregate({
    'A': ['sum', 'min'],
    'B': ['max', 'min'],
    'C': [np.sum, np.mean],
})

         A    B     C
max    NaN  8.0   NaN
mean   NaN  NaN   6.0
min    1.0  2.0   NaN
sum   12.0  NaN  18.0

### Задание

Произведите агрегацию средним по рядам

In [156]:
df = pd.DataFrame(
    ([1, 2, 3], [4, 5, 6], [7, 8, 9]), 
    columns=['x1', 'x2', 'x3'])
df

   x1  x2  x3
0   1   2   3
1   4   5   6
2   7   8   9

In [158]:
# TODO - произведите агрегацию по рядам (найти среднее)
df.aggregate('mean',axis=1)

0    2.0
1    5.0
2    8.0
dtype: float64

## Группировки

Игры закончились - начались серьезные вещи. Группировки это один из сильнейших инструментов, которые позволяют вытаскивать из данных полезную информацию!

Для понимания разберем пример: допустим, у нас есть база данных студентов с 1 по 4 курсы. Одна из колонок будет иметь в качестве значения номер курса и так, как количество допустимых значений ограничено - то правильно считать эту колонку категориальной. Другая колонка - оценка за общий университетский тест (все курсы его проходили). Третьей колонкой будет время выполнения:

In [160]:
data = [
    [1, 4.7, 60],
    [3, 4.5, 45],
    [4, 4.8, 40],
    [1, 4.9, 58],
    [2, 4.1, 50],
    [2, 4.2, 49],
    [2, 4.4, 49],
    [3, 4.9, 46],
    [4, 4.3, 33],
]

stud_df = pd.DataFrame(data, columns=['Grade', 'Test_Mark', 'Time'])
stud_df

   Grade  Test_Mark  Time
0      1        4.7    60
1      3        4.5    45
2      4        4.8    40
3      1        4.9    58
4      2        4.1    50
5      2        4.2    49
6      2        4.4    49
7      3        4.9    46
8      4        4.3    33

Теперь представим, что мы сложим каждый курс в свою корзинку путем группировки:

In [161]:
gr_stud_df = stud_df.groupby(by='Grade')

# Тип результата - pd.DataFrameGroupBy
print(type(gr_stud_df))

# Таким образом увидим словарь:
#   Ключи - названия групп
#   Значения - индексы из данных для группы
gr_stud_df.groups

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

{1: Int64Index([0, 3], dtype='int64'),
 2: Int64Index([4, 5, 6], dtype='int64'),
 3: Int64Index([1, 7], dtype='int64'),
 4: Int64Index([2, 8], dtype='int64')}

После того, как мы сложили записи по группам, мы можем вычислить, например, среднее значение в каждой группе:

In [162]:
gr_stud_df.agg('mean')

       Test_Mark       Time
Grade
1       4.800000  59.000000
2       4.233333  49.333333
3       4.700000  45.500000
4       4.550000  36.500000

В результате, мы смогли вычислить среднюю оценку за тест по каждому курсу! И для этого нам потребовалось всего два метода! Ручным вариантом нам бы пришлось создавать контейнеры, складывать в них значения и потом вычислять средние значения...

Резюмируя, группировка - размещение данных по группам уникальных значений признака, по которому группируется. После группировки можно произвести агрегацию данных в каждой группе.

In [163]:
# Более сложный вариант - найдем средние и минимальные время и оценку 

gr_stud_df.agg(['mean', 'min'])

      Test_Mark            Time
           mean  min       mean min
Grade
1      4.800000  4.7  59.000000  58
2      4.233333  4.1  49.333333  49
3      4.700000  4.5  45.500000  45
4      4.550000  4.3  36.500000  33

In [164]:
# Или зададим правила для каждого признака по отдельности

res = gr_stud_df.agg({
    'Test_Mark': ['mean', 'min'],
    'Time': ['min']
})

print(type(res))
res

<class 'pandas.core.frame.DataFrame'>

      Test_Mark      Time
           mean  min  min
Grade
1      4.800000  4.7   58
2      4.233333  4.1   49
3      4.700000  4.5   45
4      4.550000  4.3   33

In [165]:
# Для обращения к данным просто используем несколько индексов, 
#   так как это DataFrame
res['Test_Mark']['mean']

Grade
1    4.800000
2    4.233333
3    4.700000
4    4.550000
Name: mean, dtype: float64

### Задание

Сгруппируйте данные по признаку x2 и найдите медиану и максимальное значения по признакам x1, x3:

In [166]:
df = pd.DataFrame({
    'x1': np.random.randint(10, 100, size=(200, )),
    'x2': np.random.choice(['low', 'high', 'medium'], size=(200, )),
    'x3': np.random.randint(-20, 30, size=(200, )),
})
df.head()

   x1      x2  x3
0  50    high   0
1  36     low  25
2  80  medium  22
3  23    high  17
4  28     low  10

In [170]:
# TODO - произведите групировку данных
#           и получите средние и максимальные значения по каждой группе
gr_df = df.groupby(by='x2')
gr_df.agg(['mean', 'max'])

               x1            x3
             mean max      mean max
x2
high    54.893333  99  3.720000  29
low     52.900000  98  5.050000  27
medium  53.815385  99  3.707692  28

# Сохранение / загрузка данных (работа с CSV)

Одним из важных инструментов в работе с таблицами является возможность сохранить результаты работы в файл или загрузить данные из файла. Пользоваться мы будем форматом CSV, который является текстовым форматом для хранения таблицы. Формат представляет собой текстовые строки, каждая колонка разделяется разделителем (запятая, точка запятой и др.), поэтому его просто понять и обрабатывать, так как не требуется никакого специального протокола для понимания.

Для сохранения данных имеется метод `DataFrame.to_csv()`:

In [171]:
import string

df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
df.head(3)

   x1  x2  x3
A   7   8   9
B   2   8   7
C   0   4   7

In [172]:
# Для сохранения задается путь до файла
df.to_csv('my_first_file.csv')

Чтобы убедиться в работе метода найдите файл рядом с ноутбуком и откройте его через редактор.

> При работе в Google Colab слева есть вкладка, которая показывает файлы на сервере.

При открытии можно увидеть четыре колонки:
- Колонка индекса;
- Три колонки из наших данных.

Теперь, когда мы имеем файл CSV в системе - можем испытать функцию загрузки `pd.read_csv()`:

In [173]:
df = pd.read_csv('my_first_file.csv')
df.head(3)

  Unnamed: 0  x1  x2  x3
0          A   7   8   9
1          B   2   8   7
2          C   0   4   7

Видна одна явная проблема - у нас появилась колонка, которая должна быть индексом, но она стала новой колонкой, а индексы создались новые. Для решения проблемы при загрузке необходимо явно задать, какая колонка считается индексом:

In [176]:
df = pd.read_csv('my_first_file.csv', index_col=0)
df.head(3)

   x1  x2  x3
A   7   8   9
B   2   8   7
C   0   4   7

Теперь все отлично и данные загрузились так, как они должны быть.

## Задание

Разберитесь в аргументах `DataFrame.to_csv()` и сохраните данные в файл так, чтобы в файл индекс не сохранялся.

In [178]:
df = pd.DataFrame(
    data=np.random.randint(0, 10, size=(15, 3)), 
    columns=['x1', 'x2', 'x3'],
    index=list(string.ascii_uppercase)[:15]
)
df.head(3)
df.to_csv('my_second_file.csv',index=False)
# TODO - сохранить в файл no_index.csv без индексов

# Задачки

Создайте фрейм с тремя колонками:
- Колонка с именами (тип - объекты);
- Колонка с стажем работы (тип - вещественный);
- Колонка с возрастом (тип - целочисленный);
- Колонка с названием любимого цвета (тип - категориальный);

Имена колонок и значения любые, не менее трех записей (строк) в фрейме.

In [241]:
# TODO - создайте фрейм и настройте правильные типы колонок
#           DataFrame.info() дожен отображать указанные типы
df = pd.DataFrame({ 'Name': ['Pashs', 'Masha','Sasha'],
                   'experience': np.array([5, 10, 15], dtype='float32'),
                   'age': [25, 35, 45],
                   'color': pd.Categorical(["blue", "green", "white"]) })

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   experience  3 non-null      float32
 2   age         3 non-null      int64
 3   color       3 non-null      category
dtypes: category(1), float32(1), int64(1), object(1)
memory usage: 295.0+ bytes

Выберите числа в ряду `ds1`, которых нет в ряду `ds2`:

> Почитайте и примение метод `Series.isin()`

In [227]:
ds1 = pd.Series([1, 2, 3, 4, 5])
ds2 = pd.Series([4, 5, 6, 7, 8, 1, 9])
mask=ds1.isin(ds2)
ds1[~mask]
# TODO - выберите значения в ds1, которых нет в ds2: 
# [2, 3]

1    2
2    3
dtype: int64

Оставьте в ряду два наиболее частых значения, остальные замените значением 'Другое':

<details>
<summary>Подсказка 1</summary>

Для определения наиболее частых значений воспользуйтесь методом `Series.value_counts()`
</details>

<details>
<summary>Подсказка 2</summary>

Чтобы получить наиболее частые значения можно воспользоваться результатом `Series.value_counts()` - атрибутом `Series.index`
</details>

<details>
<summary>Подсказка 3</summary>

Получив наиболее частые значения, можно индексировать другие через маску метода `Series.isin()`
</details>

In [226]:
ds = pd.Series([2, 2, 2, 4, 4, 4, 3, 1, 1, 1, 1, 4])
ind=ds.value_counts().index
mask=ds.isin(ind[0:2])
ds[~mask]='Другое'
ds
# TODO - определите два наиболее частых значения в ряду (1, 4),
#           остальные замените значением 'Другое'
# ['Другое', 'Другое', 'Другое', 4, 4, 4, 'Другое', 1, 1, 1, 1, 4]

0     Другое
1     Другое
2     Другое
3          4
4          4
5          4
6     Другое
7          1
8          1
9          1
10         1
11         4
dtype: object

Сделайте каждую первую букву в словах ряда заглавной:

In [218]:
def upper_first (string):
   return string[0].upper() + string[1:]

ds = pd.Series(['how', 'to', 'use', 'pandas?'])
ds=ds.apply(upper_first)
print(ds)
# TODO - сделайте каждую первую букву заглавной с помощью Series.apply()

0        How
1         To
2        Use
3    Pandas?
dtype: object

Выберите записи с максимальным значением по колонке `x1`:

In [207]:
df = pd.DataFrame(
    np.random.randint(0, 4, size=(15, 3)), 
    columns=['x1', 'x2', 'x3']
)

# TODO - выберите те записи, которые имеют x1 равный 
#           максимальному значению в колонке x1
df[np.max(df['x1'])==df['x1']]

    x1  x2  x3
3    3   1   3
6    3   2   2
10   3   2   3
12   3   1   3

Выведите количество пропусков в каждой колонке данных:

In [206]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - отобразите количество пропусков в данных по каждой колонке
print(df.isna().sum(axis=0))

Manufacturer           4
Model                  1
Type                   3
Min.Price              7
Price                  2
Max.Price              5
MPG.city               9
MPG.highway            2
AirBags                6
DriveTrain             7
Cylinders              5
EngineSize             2
Horsepower             7
RPM                    3
Rev.per.mile           6
Man.trans.avail        5
Fuel.tank.capacity     8
Passengers             2
Length                 4
Wheelbase              1
Width                  6
Turn.circle            5
Rear.seat.room         4
Luggage.room          19
Weight                 7
Origin                 5
Make                   3
dtype: int64

Замените пропущенные значения в колонке `Min.Price` средним значениям по этой колонке:

In [205]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')

# TODO - заполните NaN в колонке Min.Price средним значением по этой колонке
# NOTE - после заполнения убедитесь, что в этой колонке нет пропущенных
print(df.isna().sum(axis=0)['Min.Price'])

df['Min.Price'].fillna(np.mean(df['Min.Price']),inplace=True)
print(df.isna().sum(axis=0)['Min.Price'])

7
0

Отсортируйте и выведите фрейм с колонками в алфавитном порядке:

In [193]:
df = pd.DataFrame(np.random.randint(0, 10, size=(5, 6)), columns=list('fbecda'))

# TODO - получите фрейм с отсортированными по именам колонкам (f e d c b a)
# NOTE - сортировка должна быть автоматической
df1=df.sort_index(axis=1)
df1

   a  b  c  d  e  f
0  2  3  3  7  1  0
1  3  5  8  5  3  4
2  2  1  2  3  4  1
3  6  9  5  6  5  6
4  3  7  0  7  2  0

Отобразите каждую 20ю запись во фрейме и только колонки `Manufacturer`, `Model`, `Type`:

In [185]:
df = pd.read_csv('https://raw.githubusercontent.com/Kail4eK/ml_edu/master/datasets/Cars93_miss.csv')
df1=df.iloc[::20]
df1=df1.loc[:,['Manufacturer', 'Model', 'Type']]
print(df)
print(df1)
# TODO - отобразите запись с периодичностью во фрейме и определенные колонки

   Manufacturer    Model     Type  ...  Weight   Origin                Make
0         Acura  Integra    Small  ...  2705.0  non-USA       Acura Integra
1           NaN   Legend  Midsize  ...  3560.0  non-USA        Acura Legend
2          Audi       90  Compact  ...  3375.0  non-USA             Audi 90
3          Audi      100  Midsize  ...  3405.0  non-USA            Audi 100
4           BMW     535i  Midsize  ...  3640.0  non-USA            BMW 535i
..          ...      ...      ...  ...     ...      ...                 ...
88   Volkswagen  Eurovan      Van  ...  3960.0      NaN  Volkswagen Eurovan
89   Volkswagen   Passat  Compact  ...  2985.0  non-USA   Volkswagen Passat
90   Volkswagen  Corrado   Sporty  ...  2810.0  non-USA  Volkswagen Corrado
91        Volvo      240  Compact  ...  2985.0  non-USA           Volvo 240
92          NaN      850  Midsize  ...  3245.0  non-USA           Volvo 850

[93 rows x 27 columns]
   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

Получите ряд, который содержит длины строк:

In [190]:
ds = pd.Series(['how', 'to', 'use', 'pandas?'])
df = pd.DataFrame(ds.apply(len))
df
# TODO - создайте ряд, содержащий длины строк:
# 0    3
# 1    2
# 2    3
# 3    7
# dtype: int64

   0
0  3
1  2
2  3
3  7